{
  "_name_or_path": "roberta-large",
  "architectures": [
    "RobertaForTokenClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": 0,
  "classifier_dropout": null,
  "eos_token_id": 2,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 1024,
  "id2label": {
    "-100": "None",
    "1": "O",
    "2": "B-p.Purpose-p.Purpose",
    "3": "B-p.SocialRel-p.Gestalt",
    "4": "B-p.Cost-p.Cost",
    "5": "B-p.Topic-p.Topic",
    "6": "B-p.Originator-p.Gestalt",
    "7": "B-p.Originator-p.Source",
    "8": "B-p.Recipient-p.Goal",
    "9": "B-p.Possessor-p.Possessor",
    "10": "B-p.Gestalt-p.Gestalt",
    "11": "B-p.Ancillary-p.Ancillary",
    "12": "I-p.Ancillary-p.Ancillary",
    "13": "B-p.ComparisonRef-p.Goal",
    "14": "B-p.Source-p.Source",
    "15": "I-p.Source-p.Source",
    "16": "B-p.Theme-p.Theme",
    "17": "B-p.Locus-p.Locus",
    "18": "B-p.Characteristic-p.Characteristic",
    "19": "B-p.Explanation-p.Explanation",
    "20": "B-p.OrgMember-p.Possessor",
    "21": "B-p.Goal-p.Goal",
    "22": "B-p.Manner-p.Manner",
    "23": "B-p.ComparisonRef-p.ComparisonRef",
    "24": "B-p.Cost-p.Locus",
    "25": "B-p.Duration-p.Duration",
    "26": "B-p.Identity-p.Identity",
    "27": "B-p.OrgMember-p.Gestalt",
    "28": "B-p.Experiencer-p.Goal",
    "29": "B-p.QuantityItem-p.Whole",
    "30": "B-p.Whole-p.Gestalt",
    "31": "B-p.PartPortion-p.PartPortion",
    "32": "I-p.PartPortion-p.PartPortion",
    "33": "B-p.Time-p.Time",
    "34": "B-p.Approximator-p.Approximator",
    "35": "B-p.Direction-p.Direction",
    "36": "B-p.Locus-p.Direction",
    "37": "B-p.Instrument-p.Path",
    "38": "I-p.Instrument-p.Path",
    "39": "B-p.QuantityItem-p.Gestalt",
    "40": "B-p.Species-p.Species",
    "41": "B-p.Org-p.Ancillary",
    "42": "B-p.Agent-p.Gestalt",
    "43": "B-p.SocialRel-p.Ancillary",
    "44": "B-p.Circumstance-p.Locus",
    "45": "B-p.Circumstance-p.Circumstance",
    "46": "B-p.Path-p.Path",
    "47": "B-p.Whole-p.Whole",
    "48": "I-p.Locus-p.Locus",
    "49": "B-p.Manner-p.Locus",
    "50": "I-p.Manner-p.Locus",
    "51": "B-p.QuantityItem-p.QuantityItem",
    "52": "B-p.Theme-p.Purpose",
    "53": "B-p.Goal-p.Locus",
    "54": "B-p.Extent-p.Extent",
    "55": "I-p.Extent-p.Extent",
    "56": "B-p.Experiencer-p.Gestalt",
    "57": "B-p.Means-p.Means",
    "58": "B-p.Beneficiary-p.Beneficiary",
    "59": "B-p.Org-p.Beneficiary",
    "60": "B-p.Stimulus-p.Topic",
    "61": "B-p.Recipient-p.Ancillary",
    "62": "B-p.Beneficiary-p.Possessor",
    "63": "B-p.Agent-p.Ancillary",
    "64": "B-p.Theme-p.Gestalt",
    "65": "B-p.StartTime-p.StartTime",
    "66": "I-p.ComparisonRef-p.ComparisonRef",
    "67": "B-p.Cost-p.Extent",
    "68": "B-p.Manner-p.Source",
    "69": "I-p.Manner-p.Source",
    "70": "B-p.Characteristic-p.Source",
    "71": "I-p.Characteristic-p.Source",
    "72": "B-p.Locus-p.Path",
    "73": "I-p.Topic-p.Topic",
    "74": "B-p.Manner-p.ComparisonRef",
    "75": "B-p.Extent-p.Whole",
    "76": "I-p.Extent-p.Whole",
    "77": "B-p.Experiencer-p.Beneficiary",
    "78": "B-p.Theme-p.ComparisonRef",
    "79": "I-p.Time-p.Time",
    "80": "B-p.Stuff-p.Stuff",
    "81": "B-p.Theme-p.Goal",
    "82": "B-p.Interval-p.Interval",
    "83": "B-p.Time-p.Whole",
    "84": "I-p.Circumstance-p.Circumstance",
    "85": "B-p.Stimulus-p.Beneficiary",
    "86": "B-p.Time-p.Interval",
    "87": "B-p.Characteristic-p.Locus",
    "88": "B-p.Characteristic-p.Extent",
    "89": "B-p.EndTime-p.EndTime",
    "90": "B-p.Experiencer-p.Ancillary",
    "91": "B-p.Agent-p.Agent",
    "92": "B-p.PartPortion-p.Source",
    "93": "B-p.Org-p.Locus",
    "94": "I-p.Characteristic-p.Locus",
    "95": "B-p.Locus-p.Source",
    "96": "I-p.Locus-p.Source",
    "97": "B-p.Duration-p.Extent",
    "98": "B-p.Characteristic-p.Identity",
    "99": "B-p.Possession-p.PartPortion",
    "100": "B-p.Possession-p.Theme",
    "101": "B-p.Whole-p.Locus",
    "102": "B-p.Direction-p.Goal",
    "103": "B-p.Gestalt-p.Locus",
    "104": "B-p.Org-p.Gestalt",
    "105": "B-p.Stimulus-p.Goal",
    "106": "B-p.Theme-p.Instrument",
    "107": "B-p.Stimulus-p.Force",
    "108": "I-p.Purpose-p.Purpose",
    "109": "B-p.Beneficiary-p.Theme",
    "110": "B-p.Characteristic-p.Goal",
    "111": "I-p.Characteristic-p.Goal",
    "112": "B-p.Time-p.Goal",
    "113": "I-p.Direction-p.Direction",
    "114": "B-p.Explanation-p.Time",
    "115": "B-p.Instrument-p.Manner",
    "116": "B-p.Possession-p.Ancillary",
    "117": "B-p.Instrument-p.Instrument",
    "118": "B-p.Ensemble-p.Ancillary",
    "119": "I-p.Cost-p.Locus",
    "120": "B-p.Recipient-p.Gestalt",
    "121": "B-p.Agent-p.Source",
    "122": "I-p.Circumstance-p.Locus",
    "123": "B-p.Whole-p.Source",
    "124": "B-p.Stimulus-p.Explanation",
    "125": "B-p.Stimulus-p.Direction",
    "126": "I-p.Explanation-p.Explanation",
    "127": "I-p.Approximator-p.Approximator",
    "128": "B-p.ComparisonRef-p.Purpose",
    "129": "B-p.ComparisonRef-p.Locus",
    "130": "I-p.QuantityItem-p.Whole",
    "131": "B-p.Theme-p.Ancillary",
    "132": "I-p.Manner-p.Manner",
    "133": "B-p.Identity-p.ComparisonRef",
    "134": "I-p.Goal-p.Locus",
    "135": "B-p.QuantityItem-p.Stuff",
    "136": "B-p.Recipient-p.Direction",
    "137": "B-p.Path-p.Locus",
    "138": "B-p.Originator-p.Agent",
    "139": "B-p.Beneficiary-p.Gestalt",
    "140": "B-p.Possessor-p.Ancillary",
    "141": "B-p.Beneficiary-p.Goal",
    "142": "B-p.OrgMember-p.PartPortion",
    "143": "B-p.PartPortion-p.ComparisonRef",
    "144": "B-p.Frequency-p.Extent",
    "145": "B-p.Beneficiary-p.Direction",
    "146": "B-p.Characteristic-p.Stuff",
    "147": "B-p.Manner-p.Extent",
    "148": "I-p.Cost-p.Cost",
    "149": "B-p.Theme-p.Whole",
    "150": "B-p.Frequency-p.Frequency",
    "151": "B-p.Purpose-p.Locus",
    "152": "B-p.Force-p.Gestalt",
    "153": "B-p.Characteristic-p.Ancillary",
    "154": "B-p.ComparisonRef-p.Source",
    "155": "B-p.Org-p.Instrument",
    "156": "B-p.Theme-p.Characteristic",
    "157": "B-p.Characteristic-p.Topic",
    "158": "I-p.Characteristic-p.Topic",
    "159": "B-p.Locus-p.Goal",
    "160": "B-p.Locus-p.Whole",
    "161": "B-p.Theme-p.Locus",
    "162": "B-p.Frequency-p.Manner",
    "163": "I-p.Frequency-p.Manner",
    "164": "I-p.Ensemble-p.Ancillary",
    "165": "B-p.Locus-p.Ancillary",
    "166": "B-p.Topic-p.Identity",
    "167": "B-p.Org-p.Goal",
    "168": "B-p.SetIteration-p.SetIteration",
    "169": "B-p.PartPortion-p.Goal",
    "170": "B-p.ComparisonRef-p.Ancillary",
    "171": "B-p.Force-p.Force",
    "172": "B-p.Approximator-p.Extent",
    "173": "I-p.Duration-p.Duration",
    "174": "B-p.Manner-p.Stuff",
    "175": "B-p.Path-p.Goal",
    "176": "B-p.Explanation-p.Source",
    "177": "B-p.Topic-p.Goal",
    "178": "I-p.Manner-p.ComparisonRef",
    "179": "B-p.Possession-p.Locus",
    "180": "B-p.Circumstance-p.Path",
    "181": "B-p.Gestalt-p.Source",
    "182": "B-p.Agent-p.Locus",
    "183": "B-p.Stimulus-p.Source",
    "184": "B-p.Org-p.Whole",
    "185": "I-p.Locus-p.Direction",
    "186": "B-p.Org-p.Source",
    "187": "B-p.Time-p.Extent",
    "188": "I-p.Goal-p.Goal",
    "189": "B-p.Possessor-p.Locus",
    "190": "B-p.Force-p.Source",
    "191": "B-p.Gestalt-p.Topic",
    "192": "I-p.Whole-p.Whole",
    "193": "B-p.Cost-p.Manner",
    "194": "B-p.Means-p.Path",
    "195": "B-p.Originator-p.Instrument",
    "196": "B-p.PartPortion-p.Instrument",
    "197": "B-p.Possession-p.Possession",
    "198": "I-p.Possession-p.Possession",
    "199": "B-p.Agent-p.Beneficiary",
    "200": "B-p.Instrument-p.Locus",
    "201": "B-p.Instrument-p.Theme",
    "202": "B-p.Duration-p.Gestalt",
    "203": "I-p.Path-p.Path",
    "204": "B-p.Theme-p.Source",
    "205": "B-p.Time-p.Gestalt",
    "206": "B-p.Time-p.Direction",
    "207": "B-p.Goal-p.Whole",
    "208": "B-p.Explanation-p.Manner",
    "209": "I-p.Explanation-p.Manner",
    "210": "I-p.Time-p.Interval",
    "211": "I-p.Org-p.Locus",
    "212": "B-p.Gestalt-p.Purpose",
    "213": "B-p.Stimulus-p.Theme",
    "214": "B-p.Locus-p.Gestalt",
    "215": "B-p.Extent-p.Identity",
    "216": "B-p.ComparisonRef-p.Beneficiary",
    "217": "B-p.Experiencer-p.Agent",
    "218": "B-p.Time-p.Duration",
    "219": "B-p.SocialRel-p.Source",
    "220": "B-p.Whole-p.Circumstance",
    "221": "B-p.Purpose-p.Goal"
  },
  "initializer_range": 0.02,
  "intermediate_size": 4096,
  "label2id": {
    "B-p.Agent-p.Agent": 91,
    "B-p.Agent-p.Ancillary": 63,
    "B-p.Agent-p.Beneficiary": 199,
    "B-p.Agent-p.Gestalt": 42,
    "B-p.Agent-p.Locus": 182,
    "B-p.Agent-p.Source": 121,
    "B-p.Ancillary-p.Ancillary": 11,
    "B-p.Approximator-p.Approximator": 34,
    "B-p.Approximator-p.Extent": 172,
    "B-p.Beneficiary-p.Beneficiary": 58,
    "B-p.Beneficiary-p.Direction": 145,
    "B-p.Beneficiary-p.Gestalt": 139,
    "B-p.Beneficiary-p.Goal": 141,
    "B-p.Beneficiary-p.Possessor": 62,
    "B-p.Beneficiary-p.Theme": 109,
    "B-p.Characteristic-p.Ancillary": 153,
    "B-p.Characteristic-p.Characteristic": 18,
    "B-p.Characteristic-p.Extent": 88,
    "B-p.Characteristic-p.Goal": 110,
    "B-p.Characteristic-p.Identity": 98,
    "B-p.Characteristic-p.Locus": 87,
    "B-p.Characteristic-p.Source": 70,
    "B-p.Characteristic-p.Stuff": 146,
    "B-p.Characteristic-p.Topic": 157,
    "B-p.Circumstance-p.Circumstance": 45,
    "B-p.Circumstance-p.Locus": 44,
    "B-p.Circumstance-p.Path": 180,
    "B-p.ComparisonRef-p.Ancillary": 170,
    "B-p.ComparisonRef-p.Beneficiary": 216,
    "B-p.ComparisonRef-p.ComparisonRef": 23,
    "B-p.ComparisonRef-p.Goal": 13,
    "B-p.ComparisonRef-p.Locus": 129,
    "B-p.ComparisonRef-p.Purpose": 128,
    "B-p.ComparisonRef-p.Source": 154,
    "B-p.Cost-p.Cost": 4,
    "B-p.Cost-p.Extent": 67,
    "B-p.Cost-p.Locus": 24,
    "B-p.Cost-p.Manner": 193,
    "B-p.Direction-p.Direction": 35,
    "B-p.Direction-p.Goal": 102,
    "B-p.Duration-p.Duration": 25,
    "B-p.Duration-p.Extent": 97,
    "B-p.Duration-p.Gestalt": 202,
    "B-p.EndTime-p.EndTime": 89,
    "B-p.Ensemble-p.Ancillary": 118,
    "B-p.Experiencer-p.Agent": 217,
    "B-p.Experiencer-p.Ancillary": 90,
    "B-p.Experiencer-p.Beneficiary": 77,
    "B-p.Experiencer-p.Gestalt": 56,
    "B-p.Experiencer-p.Goal": 28,
    "B-p.Explanation-p.Explanation": 19,
    "B-p.Explanation-p.Manner": 208,
    "B-p.Explanation-p.Source": 176,
    "B-p.Explanation-p.Time": 114,
    "B-p.Extent-p.Extent": 54,
    "B-p.Extent-p.Identity": 215,
    "B-p.Extent-p.Whole": 75,
    "B-p.Force-p.Force": 171,
    "B-p.Force-p.Gestalt": 152,
    "B-p.Force-p.Source": 190,
    "B-p.Frequency-p.Extent": 144,
    "B-p.Frequency-p.Frequency": 150,
    "B-p.Frequency-p.Manner": 162,
    "B-p.Gestalt-p.Gestalt": 10,
    "B-p.Gestalt-p.Locus": 103,
    "B-p.Gestalt-p.Purpose": 212,
    "B-p.Gestalt-p.Source": 181,
    "B-p.Gestalt-p.Topic": 191,
    "B-p.Goal-p.Goal": 21,
    "B-p.Goal-p.Locus": 53,
    "B-p.Goal-p.Whole": 207,
    "B-p.Identity-p.ComparisonRef": 133,
    "B-p.Identity-p.Identity": 26,
    "B-p.Instrument-p.Instrument": 117,
    "B-p.Instrument-p.Locus": 200,
    "B-p.Instrument-p.Manner": 115,
    "B-p.Instrument-p.Path": 37,
    "B-p.Instrument-p.Theme": 201,
    "B-p.Interval-p.Interval": 82,
    "B-p.Locus-p.Ancillary": 165,
    "B-p.Locus-p.Direction": 36,
    "B-p.Locus-p.Gestalt": 214,
    "B-p.Locus-p.Goal": 159,
    "B-p.Locus-p.Locus": 17,
    "B-p.Locus-p.Path": 72,
    "B-p.Locus-p.Source": 95,
    "B-p.Locus-p.Whole": 160,
    "B-p.Manner-p.ComparisonRef": 74,
    "B-p.Manner-p.Extent": 147,
    "B-p.Manner-p.Locus": 49,
    "B-p.Manner-p.Manner": 22,
    "B-p.Manner-p.Source": 68,
    "B-p.Manner-p.Stuff": 174,
    "B-p.Means-p.Means": 57,
    "B-p.Means-p.Path": 194,
    "B-p.Org-p.Ancillary": 41,
    "B-p.Org-p.Beneficiary": 59,
    "B-p.Org-p.Gestalt": 104,
    "B-p.Org-p.Goal": 167,
    "B-p.Org-p.Instrument": 155,
    "B-p.Org-p.Locus": 93,
    "B-p.Org-p.Source": 186,
    "B-p.Org-p.Whole": 184,
    "B-p.OrgMember-p.Gestalt": 27,
    "B-p.OrgMember-p.PartPortion": 142,
    "B-p.OrgMember-p.Possessor": 20,
    "B-p.Originator-p.Agent": 138,
    "B-p.Originator-p.Gestalt": 6,
    "B-p.Originator-p.Instrument": 195,
    "B-p.Originator-p.Source": 7,
    "B-p.PartPortion-p.ComparisonRef": 143,
    "B-p.PartPortion-p.Goal": 169,
    "B-p.PartPortion-p.Instrument": 196,
    "B-p.PartPortion-p.PartPortion": 31,
    "B-p.PartPortion-p.Source": 92,
    "B-p.Path-p.Goal": 175,
    "B-p.Path-p.Locus": 137,
    "B-p.Path-p.Path": 46,
    "B-p.Possession-p.Ancillary": 116,
    "B-p.Possession-p.Locus": 179,
    "B-p.Possession-p.PartPortion": 99,
    "B-p.Possession-p.Possession": 197,
    "B-p.Possession-p.Theme": 100,
    "B-p.Possessor-p.Ancillary": 140,
    "B-p.Possessor-p.Locus": 189,
    "B-p.Possessor-p.Possessor": 9,
    "B-p.Purpose-p.Goal": 221,
    "B-p.Purpose-p.Locus": 151,
    "B-p.Purpose-p.Purpose": 2,
    "B-p.QuantityItem-p.Gestalt": 39,
    "B-p.QuantityItem-p.QuantityItem": 51,
    "B-p.QuantityItem-p.Stuff": 135,
    "B-p.QuantityItem-p.Whole": 29,
    "B-p.Recipient-p.Ancillary": 61,
    "B-p.Recipient-p.Direction": 136,
    "B-p.Recipient-p.Gestalt": 120,
    "B-p.Recipient-p.Goal": 8,
    "B-p.SetIteration-p.SetIteration": 168,
    "B-p.SocialRel-p.Ancillary": 43,
    "B-p.SocialRel-p.Gestalt": 3,
    "B-p.SocialRel-p.Source": 219,
    "B-p.Source-p.Source": 14,
    "B-p.Species-p.Species": 40,
    "B-p.StartTime-p.StartTime": 65,
    "B-p.Stimulus-p.Beneficiary": 85,
    "B-p.Stimulus-p.Direction": 125,
    "B-p.Stimulus-p.Explanation": 124,
    "B-p.Stimulus-p.Force": 107,
    "B-p.Stimulus-p.Goal": 105,
    "B-p.Stimulus-p.Source": 183,
    "B-p.Stimulus-p.Theme": 213,
    "B-p.Stimulus-p.Topic": 60,
    "B-p.Stuff-p.Stuff": 80,
    "B-p.Theme-p.Ancillary": 131,
    "B-p.Theme-p.Characteristic": 156,
    "B-p.Theme-p.ComparisonRef": 78,
    "B-p.Theme-p.Gestalt": 64,
    "B-p.Theme-p.Goal": 81,
    "B-p.Theme-p.Instrument": 106,
    "B-p.Theme-p.Locus": 161,
    "B-p.Theme-p.Purpose": 52,
    "B-p.Theme-p.Source": 204,
    "B-p.Theme-p.Theme": 16,
    "B-p.Theme-p.Whole": 149,
    "B-p.Time-p.Direction": 206,
    "B-p.Time-p.Duration": 218,
    "B-p.Time-p.Extent": 187,
    "B-p.Time-p.Gestalt": 205,
    "B-p.Time-p.Goal": 112,
    "B-p.Time-p.Interval": 86,
    "B-p.Time-p.Time": 33,
    "B-p.Time-p.Whole": 83,
    "B-p.Topic-p.Goal": 177,
    "B-p.Topic-p.Identity": 166,
    "B-p.Topic-p.Topic": 5,
    "B-p.Whole-p.Circumstance": 220,
    "B-p.Whole-p.Gestalt": 30,
    "B-p.Whole-p.Locus": 101,
    "B-p.Whole-p.Source": 123,
    "B-p.Whole-p.Whole": 47,
    "I-p.Ancillary-p.Ancillary": 12,
    "I-p.Approximator-p.Approximator": 127,
    "I-p.Characteristic-p.Goal": 111,
    "I-p.Characteristic-p.Locus": 94,
    "I-p.Characteristic-p.Source": 71,
    "I-p.Characteristic-p.Topic": 158,
    "I-p.Circumstance-p.Circumstance": 84,
    "I-p.Circumstance-p.Locus": 122,
    "I-p.ComparisonRef-p.ComparisonRef": 66,
    "I-p.Cost-p.Cost": 148,
    "I-p.Cost-p.Locus": 119,
    "I-p.Direction-p.Direction": 113,
    "I-p.Duration-p.Duration": 173,
    "I-p.Ensemble-p.Ancillary": 164,
    "I-p.Explanation-p.Explanation": 126,
    "I-p.Explanation-p.Manner": 209,
    "I-p.Extent-p.Extent": 55,
    "I-p.Extent-p.Whole": 76,
    "I-p.Frequency-p.Manner": 163,
    "I-p.Goal-p.Goal": 188,
    "I-p.Goal-p.Locus": 134,
    "I-p.Instrument-p.Path": 38,
    "I-p.Locus-p.Direction": 185,
    "I-p.Locus-p.Locus": 48,
    "I-p.Locus-p.Source": 96,
    "I-p.Manner-p.ComparisonRef": 178,
    "I-p.Manner-p.Locus": 50,
    "I-p.Manner-p.Manner": 132,
    "I-p.Manner-p.Source": 69,
    "I-p.Org-p.Locus": 211,
    "I-p.PartPortion-p.PartPortion": 32,
    "I-p.Path-p.Path": 203,
    "I-p.Possession-p.Possession": 198,
    "I-p.Purpose-p.Purpose": 108,
    "I-p.QuantityItem-p.Whole": 130,
    "I-p.Source-p.Source": 15,
    "I-p.Time-p.Interval": 210,
    "I-p.Time-p.Time": 79,
    "I-p.Topic-p.Topic": 73,
    "I-p.Whole-p.Whole": 192,
    "None": -100,
    "O": 1
  },
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 514,
  "model_type": "roberta",
  "num_attention_heads": 16,
  "num_hidden_layers": 24,
  "pad_token_id": 1,
  "position_embedding_type": "absolute",
  "torch_dtype": "float32",
  "transformers_version": "4.37.2",
  "type_vocab_size": 1,
  "use_cache": true,
  "vocab_size": 50265
}
